# TrussFamilyTopChord Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..TrussFamilyTopChord Property
GroupTypeId Class See Also
---
Top Chords.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId TrussFamilyTopChord { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussFamilyTopChord As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussFamilyTopChord {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace